app/Controllers/Admin.php

    public function mahasiswa()
    {
        $model = new MahasiswaModel();
        $data['mahasiswa'] = $model->findAll();
---
SELECT *
FROM `mahasiswa`

    public function storeMahasiswa()
    {
        $model = new MahasiswaModel();
        $data = [
            'nama' => $this->request->getPost('nama'),
            'jurusan' => $this->request->getPost('jurusan'),
            'semester' => $this->request->getPost('semester')
        ];
        $model->insert($data);
---
INSERT INTO `mahasiswa` (`nama`, `jurusan`, `semester`) VALUES ('minan', 'Teknik Informatika', '5')

    public function deleteMahasiswa($id)
    {
        $model = new MahasiswaModel();
        $model->delete($id);
---
DELETE FROM `mahasiswa`
WHERE `id` IN ('10')